Examinator/src/Catalogs/ВариантыОтветовНаВопросСУЗ/ВариантыОтветовНаВопросСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыОтветовНаВопросСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВопросыСУЗ</owners>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВернаяГруппаФасетов</name>
    <type>
      <types>CatalogRef.ФасетыВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Верный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДоступныхВариантов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииВариантовОтветовНаВопросСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредлагатьВыборВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсДляВерногоКомментария</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсДляОшибочногоКомментария</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>БаллПриПсихологическомТестировании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/ТипыВопросовСУЗ/ТипыВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВопросовСУЗ</name>
  <enumValues>
    <name>МногиеИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногих</name>
  </enumValues>
  <enumValues>
    <name>Последовательность</name>
  </enumValues>
  <enumValues>
    <name>ПоШаблону</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ЭлементActiveX</name>
  </enumValues>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>РаботаВПрограмме</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногихПсихологический</name>
  </enumValues>
  <enumValues>
    <name>МногиеИзМногихПсихологический</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ВопросыСУЗ/ВопросыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаРезультата</name>
    <type>
      <types>EnumRef.МетодыРасчетаРезультатаВопросаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВарианты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасетныйВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <comment>Имя макета, которое задано в синониме перечисления</comment>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементActiveX</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенРазвернутыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьИменаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеГрупп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКатегорий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВариантовОтветов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафЗаПодсказку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтальноеРазмещениеВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеВариантов</name>
    <type>
      <types>EnumRef.ОтображениеВариантовВопросаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйВыводВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТекста</name>
    <type>
      <types>CatalogRef.ШаблоныТекстаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйПродукт</name>
    <type>
      <types>CatalogRef.ПрограммныеПродуктыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьКомментарииКВариантамОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыРаботыВПрограмме</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВариантыРаботыСПрограммойСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполняетсяПрограммой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выделить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ВариантыОтветовНаВопросСУЗ/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаВладелец; // Форма, из которой открыта эта форма

#КонецОбласти


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Устанавливаем переменные
	
	Если Параметры.ДополнительныеПараметры.Свойство("Подборка") Тогда
		Подборка = Параметры.ДополнительныеПараметры.Подборка;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Текст;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ВерныйКомментарий;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ОшибочныйКомментарий;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////

	ДоступныеТипы = Новый Массив();
	ДоступныеТипы.Добавить(Тип("СправочникСсылка.РесурсыСУЗ"));
	
	Элементы.Ресурс.ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Заполняем реквизиты, хранящиеся в регистре ДанныеВопросыСУЗ
	
	ФормаВладелец = ОбщегоНазначенияСУКлиент.НайтиВладельцаУправляемойФормы(ВладелецФормы);
	
	Если ФормаВладелец <> Неопределено
		И ФормаВладелец.ИмяФормы = "Справочник.ВопросыСУЗ.Форма.ФормаЭлемента" Тогда
		
		Для каждого Строка Из ФормаВладелец.ДанныеВариантовОтветов Цикл
		
			Если Строка.ВариантОтвета = Объект.Ссылка Тогда
				Текст                = Строка.Текст;
				ВерныйКомментарий    = Строка.ВерныйКомментарий;
				ОшибочныйКомментарий = Строка.ОшибочныйКомментарий;
			КонецЕсли;
		
		КонецЦикла;
		
		УстановитьДоступностьЭлементовФормыНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите текст варианта ответа'"),,"Текст",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если НЕ Объект.Ссылка.Пустая()
		И ФормаВладелец.ИмяФормы = "Справочник.ВопросыСУЗ.Форма.ФормаЭлемента" Тогда
		
		СтрокаВарианта = Неопределено;
		
		Для каждого Строка Из ФормаВладелец.ДанныеВариантовОтветов Цикл
			Если Строка.ВариантОтвета = Объект.Ссылка Тогда
				СтрокаВарианта = Строка;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаВарианта = Неопределено Тогда
			СтрокаВарианта = ФормаВладелец.ДанныеВариантовОтветов.Добавить();
		КонецЕсли;
			
		СтрокаВарианта.Текст                = Текст;
		СтрокаВарианта.ВерныйКомментарий    = ВерныйКомментарий;
		СтрокаВарианта.ОшибочныйКомментарий = ОшибочныйКомментарий;
		СтрокаВарианта.ВариантОтвета        = Объект.Ссылка;

		ФормаВладелец.ВывестиТекстыВариантов();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохраняем в базе
		
	СтруктураДанныхВариантов = Новый Структура;
	СтруктураДанныхВариантов.Вставить("ТекстовыеДанные", Текст);
	СтруктураДанныхВариантов.Вставить("ВерныйКомментарий", ВерныйКомментарий);
	СтруктураДанныхВариантов.Вставить("ОшибочныйКомментарий", ОшибочныйКомментарий);
	
	РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект.Владелец, СтруктураДанныхВариантов, ТекущийОбъект.Ссылка, "ВсеРеквизиты");	
 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура РесурсСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка, Подборка); 
КонецПроцедуры

&НаКлиенте
Процедура РесурсОткрытие(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, Объект.Ресурс); 
КонецПроцедуры

&НаКлиенте
Процедура РесурсОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляВерногоКомментарияСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка, Подборка);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляВерногоКомментарияОткрытие(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, Объект.РесурсДляВерногоКомментария);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляВерногоКомментарияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляОшибочногоКомментарияОткрытие(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, Объект.РесурсДляОшибочногоКомментария);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляОшибочногоКомментарияСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка, Подборка);
КонецПроцедуры

&НаКлиенте
Процедура РесурсДляОшибочногоКомментарияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормыНаКлиенте()
	
	// ВернаяГруппаФасетов (видимость)
	
	Если ФормаВладелец.Объект.ФасетныйВопрос Тогда
		Элементы.ВернаяГруппаФасетов.Видимость = Истина;
	Иначе
		Элементы.ВернаяГруппаФасетов.Видимость = Ложь;
	КонецЕсли;
	
	// Категория (видимость)
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Таблица") Тогда
		Элементы.Категория.Видимость = Истина;
	Иначе
		Элементы.Категория.Видимость = Ложь;
	КонецЕсли;
	
	// Ресурс
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ПоШаблону") Тогда
		Элементы.Ресурс.Доступность = Ложь;
	Иначе
		Элементы.Ресурс.Доступность = Истина;
	КонецЕсли;	
	
	// Наименование
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ПоШаблону") Тогда
		Элементы.Наименование.Доступность = Ложь;
	Иначе
		Элементы.Наименование.Доступность = Истина;
	КонецЕсли;	
	
	// Верный (доступность)

	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Таблица")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Последовательность")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Соответствие") Тогда
		Элементы.Верный.Доступность = Ложь;
	Иначе
		Элементы.Верный.Доступность = Истина;
	КонецЕсли;
	
	// Комментарии (доступность)
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Последовательность")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ПоШаблону")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ОдинИзМногихПсихологический")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.МногиеИзМногихПсихологический") Тогда
		Элементы.Комментарии.Видимость = Ложь;
	Иначе
		Элементы.Комментарии.Видимость = Истина;
	КонецЕсли;
	
	// Балл и опция Верный (видимость)
	
	Если ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ОдинИзМногихПсихологический")
		ИЛИ ФормаВладелец.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.МногиеИзМногихПсихологический") Тогда
		Элементы.Верный.Видимость = Ложь;
		Элементы.ГруппаБаллПриПсихологическомТестировании.Видимость = Истина;
	Иначе
		Элементы.Верный.Видимость = Истина;
		Элементы.ГруппаБаллПриПсихологическомТестировании.Видимость = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти
